{
  "subject": "Competências Constitucionais",
  "subtopicsLabel": "Competências",
  "topics": {
    "name": "Tipos de Competências",
    "values": [
      {
        "name": "Competências Privativas da União",
        "key": "PRIV",
        "comment": "Competências exclusivas da União para legislar, que podem ser delegadas aos Estados por lei complementar (Art. 22).",
        "subtopics": [
          {
            "name": "Legislar sobre direito civil, comercial, penal, processual",
            "key": "ART22-I",
            "comment": "Art. 22, I - Compete privativamente à União legislar sobre direito civil, comercial, penal, processual, eleitoral, agrário, marítimo, aeronáutico, espacial e do trabalho."
          },
          {
            "name": "Legislar sobre desapropriação",
            "key": "ART22-II",
            "comment": "Art. 22, II - Compete privativamente à União legislar sobre desapropriação."
          },
          {
            "name": "Legislar sobre requisições civis e militares",
            "key": "ART22-III",
            "comment": "Art. 22, III - Compete privativamente à União legislar sobre requisições civis e militares, em caso de iminente perigo e em tempo de guerra."
          },
          {
            "name": "Legislar sobre águas, energia, informática",
            "key": "ART22-IV",
            "comment": "Art. 22, IV - Compete privativamente à União legislar sobre águas, energia, informática, telecomunicações e radiodifusão."
          },
          {
            "name": "Legislar sobre serviço postal",
            "key": "ART22-V",
            "comment": "Art. 22, V - Compete privativamente à União legislar sobre serviço postal e correio aéreo nacional."
          },
          {
            "name": "Legislar sobre sistema monetário",
            "key": "ART22-VI",
            "comment": "Art. 22, VI - Compete privativamente à União legislar sobre sistema monetário e de medidas, títulos e garantias dos metais."
          },
          {
            "name": "Legislar sobre política de crédito",
            "key": "ART22-VII",
            "comment": "Art. 22, VII - Compete privativamente à União legislar sobre política de crédito, câmbio, seguros e transferência de valores."
          },
          {
            "name": "Legislar sobre comércio exterior e interestadual",
            "key": "ART22-VIII",
            "comment": "Art. 22, VIII - Compete privativamente à União legislar sobre comércio exterior e interestadual."
          }
        ]
      },
      {
        "name": "Competências Exclusivas da União",
        "key": "EXCL",
        "comment": "Competências materiais indelegáveis da União para executar ações administrativas (Art. 21).",
        "subtopics": [
          {
            "name": "Manter relações com Estados estrangeiros",
            "key": "ART21-I",
            "comment": "Art. 21, I - Compete à União manter relações com Estados estrangeiros e participar de organizações internacionais."
          },
          {
            "name": "Declarar guerra e celebrar a paz",
            "key": "ART21-II",
            "comment": "Art. 21, II - Compete à União declarar a guerra e celebrar a paz."
          },
          {
            "name": "Assegurar a defesa nacional",
            "key": "ART21-III",
            "comment": "Art. 21, III - Compete à União assegurar a defesa nacional."
          },
          {
            "name": "Permitir que forças estrangeiras transitem",
            "key": "ART21-IV",
            "comment": "Art. 21, IV - Compete à União permitir, nos casos previstos em lei complementar, que forças estrangeiras transitem pelo território nacional ou nele permaneçam temporariamente."
          },
          {
            "name": "Decretar estado de sítio e de defesa",
            "key": "ART21-V",
            "comment": "Art. 21, V - Compete à União decretar o estado de sítio, o estado de defesa e a intervenção federal."
          },
          {
            "name": "Autorizar e fiscalizar produção de material bélico",
            "key": "ART21-VI",
            "comment": "Art. 21, VI - Compete à União autorizar e fiscalizar a produção e o comércio de material bélico."
          },
          {
            "name": "Emitir moeda",
            "key": "ART21-VII",
            "comment": "Art. 21, VII - Compete à União emitir moeda."
          },
          {
            "name": "Administrar reservas cambiais",
            "key": "ART21-VIII",
            "comment": "Art. 21, VIII - Compete à União administrar as reservas cambiais do País e fiscalizar as operações de natureza financeira."
          }
        ]
      },
      {
        "name": "Competências Concorrentes",
        "key": "CONC",
        "comment": "Competências legislativas compartilhadas entre União, Estados e DF, com normas gerais da União e suplementares dos Estados (Art. 24).",
        "subtopics": [
          {
            "name": "Direito tributário, financeiro, penitenciário",
            "key": "ART24-I",
            "comment": "Art. 24, I - Compete à União, aos Estados e ao Distrito Federal legislar concorrentemente sobre direito tributário, financeiro, penitenciário, econômico e urbanístico."
          },
          {
            "name": "Orçamento",
            "key": "ART24-II",
            "comment": "Art. 24, II - Compete à União, aos Estados e ao Distrito Federal legislar concorrentemente sobre orçamento."
          },
          {
            "name": "Juntas comerciais",
            "key": "ART24-III",
            "comment": "Art. 24, III - Compete à União, aos Estados e ao Distrito Federal legislar concorrentemente sobre juntas comerciais."
          },
          {
            "name": "Custas dos serviços forenses",
            "key": "ART24-IV",
            "comment": "Art. 24, IV - Compete à União, aos Estados e ao Distrito Federal legislar concorrentemente sobre custas dos serviços forenses."
          },
          {
            "name": "Produção e consumo",
            "key": "ART24-V",
            "comment": "Art. 24, V - Compete à União, aos Estados e ao Distrito Federal legislar concorrentemente sobre produção e consumo."
          },
          {
            "name": "Florestas, caça, pesca, fauna, flora",
            "key": "ART24-VI",
            "comment": "Art. 24, VI - Compete à União, aos Estados e ao Distrito Federal legislar concorrentemente sobre florestas, caça, pesca, fauna, conservação da natureza, defesa do solo e dos recursos naturais, proteção do meio ambiente e controle da poluição."
          },
          {
            "name": "Proteção ao patrimônio histórico",
            "key": "ART24-VII",
            "comment": "Art. 24, VII - Compete à União, aos Estados e ao Distrito Federal legislar concorrentemente sobre proteção ao patrimônio histórico, cultural, artístico, turístico e paisagístico."
          },
          {
            "name": "Responsabilidade por dano ao meio ambiente",
            "key": "ART24-VIII",
            "comment": "Art. 24, VIII - Compete à União, aos Estados e ao Distrito Federal legislar concorrentemente sobre responsabilidade por dano ao meio ambiente, ao consumidor, a bens e direitos de valor artístico, estético, histórico, turístico e paisagístico."
          }
        ]
      },
      {
        "name": "Competências dos Estados",
        "key": "EST",
        "comment": "Competências residuais dos Estados, incluindo tudo que não for vedado pela Constituição (Art. 25).",
        "subtopics": [
          {
            "name": "Competências remanescentes",
            "key": "ART25-P1",
            "comment": "Art. 25, § 1º - São reservadas aos Estados as competências que não lhes sejam vedadas por esta Constituição."
          },
          {
            "name": "Explorar serviços locais de gás canalizado",
            "key": "ART25-P2",
            "comment": "Art. 25, § 2º - Cabe aos Estados explorar diretamente, ou mediante concessão, os serviços locais de gás canalizado, na forma da lei."
          },
          {
            "name": "Instituir regiões metropolitanas",
            "key": "ART25-P3",
            "comment": "Art. 25, § 3º - Os Estados poderão, mediante lei complementar, instituir regiões metropolitanas, aglomerações urbanas e microrregiões."
          },
          {
            "name": "Organizar Poder Judiciário",
            "key": "ART125",
            "comment": "Art. 125 - Os Estados organizarão sua Justiça, observados os princípios estabelecidos nesta Constituição."
          },
          {
            "name": "Organizar Ministério Público",
            "key": "ART128",
            "comment": "Art. 128 - O Ministério Público abrange o Ministério Público da União e os Ministérios Públicos dos Estados."
          }
        ]
      },
      {
        "name": "Competências Comuns",
        "key": "COM",
        "comment": "Competências materiais compartilhadas entre todos os entes federativos para execução de ações administrativas (Art. 23).",
        "subtopics": [
          {
            "name": "Zelar pela guarda da Constituição",
            "key": "ART23-I",
            "comment": "Art. 23, I - É competência comum da União, dos Estados, do Distrito Federal e dos Municípios zelar pela guarda da Constituição, das leis e das instituições democráticas."
          },
          {
            "name": "Cuidar da saúde e assistência pública",
            "key": "ART23-II",
            "comment": "Art. 23, II - É competência comum da União, dos Estados, do Distrito Federal e dos Municípios cuidar da saúde e assistência pública, da proteção e garantia das pessoas portadoras de deficiência."
          },
          {
            "name": "Proteger documentos e sítios históricos",
            "key": "ART23-III",
            "comment": "Art. 23, III - É competência comum da União, dos Estados, do Distrito Federal e dos Municípios proteger os documentos, as obras e outros bens de valor histórico, artístico e cultural."
          },
          {
            "name": "Impedir evasão, destruição de obras de arte",
            "key": "ART23-IV",
            "comment": "Art. 23, IV - É competência comum da União, dos Estados, do Distrito Federal e dos Municípios impedir a evasão, a destruição e a descaracterização de obras de arte e de outros bens de valor histórico, artístico ou cultural."
          },
          {
            "name": "Proporcionar meios de acesso à cultura",
            "key": "ART23-V",
            "comment": "Art. 23, V - É competência comum da União, dos Estados, do Distrito Federal e dos Municípios proporcionar os meios de acesso à cultura, à educação, à ciência, à tecnologia, à pesquisa e à inovação."
          },
          {
            "name": "Proteger meio ambiente e combater poluição",
            "key": "ART23-VI",
            "comment": "Art. 23, VI - É competência comum da União, dos Estados, do Distrito Federal e dos Municípios proteger o meio ambiente e combater a poluição em qualquer de suas formas."
          },
          {
            "name": "Preservar florestas, fauna e flora",
            "key": "ART23-VII",
            "comment": "Art. 23, VII - É competência comum da União, dos Estados, do Distrito Federal e dos Municípios preservar as florestas, a fauna e a flora."
          },
          {
            "name": "Fomentar produção agropecuária",
            "key": "ART23-VIII",
            "comment": "Art. 23, VIII - É competência comum da União, dos Estados, do Distrito Federal e dos Municípios fomentar a produção agropecuária e organizar o abastecimento alimentar."
          }
        ]
      },
      {
        "name": "Competências dos Municípios",
        "key": "MUN",
        "comment": "Competências dos Municípios para legislar sobre assuntos de interesse local e prestar serviços públicos locais (Art. 30).",
        "subtopics": [
          {
            "name": "Legislar sobre assuntos de interesse local",
            "key": "ART30-I",
            "comment": "Art. 30, I - Compete aos Municípios legislar sobre assuntos de interesse local."
          },
          {
            "name": "Suplementar legislação federal e estadual",
            "key": "ART30-II",
            "comment": "Art. 30, II - Compete aos Municípios suplementar a legislação federal e a estadual no que couber."
          },
          {
            "name": "Instituir e arrecadar tributos",
            "key": "ART30-III",
            "comment": "Art. 30, III - Compete aos Municípios instituir e arrecadar os tributos de sua competência."
          },
          {
            "name": "Criar, organizar e suprimir distritos",
            "key": "ART30-IV",
            "comment": "Art. 30, IV - Compete aos Municípios criar, organizar e suprimir distritos, observada a legislação estadual."
          },
          {
            "name": "Organizar e prestar serviços públicos locais",
            "key": "ART30-V",
            "comment": "Art. 30, V - Compete aos Municípios organizar e prestar, diretamente ou sob regime de concessão ou permissão, os serviços públicos de interesse local."
          },
          {
            "name": "Manter programas de educação infantil",
            "key": "ART30-VI",
            "comment": "Art. 30, VI - Compete aos Municípios manter, com a cooperação técnica e financeira da União e do Estado, programas de educação infantil e de ensino fundamental."
          },
          {
            "name": "Prestar serviços de atendimento à saúde",
            "key": "ART30-VII",
            "comment": "Art. 30, VII - Compete aos Municípios prestar, com a cooperação técnica e financeira da União e do Estado, serviços de atendimento à saúde da população."
          },
          {
            "name": "Promover ordenamento territorial",
            "key": "ART30-VIII",
            "comment": "Art. 30, VIII - Compete aos Municípios promover, no que couber, adequado ordenamento territorial, mediante planejamento e controle do uso, do parparcelamento e da ocupação do solo urbano."
          }
        ]
      }
    ]
  }
}